[
  {
    "state": "Arizona",
    "short_name": "AZ",
    "title": "Arizona Solar Incentives & Rebates",
    "image": "AZ.png",
    "list": [
      {
        "list_title": "Arizona is Leading The Way Thanks To Solar Incentives",
        "list_descriptions": "Being one of the sunniest states in the country makes Arizona ideal for Solar Power. So it comes as no surprise to find the state topping the charts across solar metrics categories. When you look at the cumulative amount of solar electric capacity installed through last year, Arizona is a leader of the pack. But why is this? Well, for one, the generous, year round sunshine. But the state’s solar incentives along with the federal solar tax credit also contribute greatly to the widespread homeowner participation in moving to Solar."
      },
      {
        "list_title": "The Residential Solar Energy Credit",
        "list_descriptions": "The Residential Solar Energy Credit offered by the state of Arizona allows homeowners to save a bundle on their solar panel system. This credit alone pays you back 25% of the system’s cost, capping at $1,000 total. If the credit exceeds your total income taxes owed, you can carry the credit forward for up to 5 years."
      },
      {
        "list_title": "Property and Sales Tax Exemptions",
        "list_descriptions": "Any homeowner who purchases a solar panel system in the state of Arizona is exempt from paying sales tax. You’ll also be granted a property tax exemption, making the value added to your home by going solar deductible from the assessed value of your property."
      },
      {
        "list_title": "The Federal Solar Tax Credit",
        "list_descriptions": "The ITC, also known as The Federal Investment Tax Credit, is also available to Arizona homeowners who purchase their solar panel system outright. This credit amounts to 30% of your solar system’s cost after deducting the value of your state rebates. By the end of 2019, however, ITC credits will drop from 30% to 26%. The following year, after 12/31/2020, the tax credits for installations will drop to 22%. This is one of many reasons why it makes sense to go solar now."
      },
      {
        "list_title": "Hassle Free Loans Provide Zero Out Of Pocket Installations",
        "list_descriptions": "Agreements and loan terms can be customized based on your needs, resulting in complete solar panel system installations with zero out of pocket upfront for the homeowner. Our specialists will work with you hand in hand to ensure you take advantage of all the state and federal incentives, credits, and rebates that are available to the Arizona homeowner. We’ll even handle all of the paperwork, streamlining the process for you to get your solar panel system installed hassle free. So just sit back and watch as your energy bill gets crunched in half."
      }
    ]
  },
  {
    "state": "California",
    "short_name": "CA",
    "title": "California Solar Incentives & Rebates",
    "image": "CA.png",
    "list": [
      {
        "list_title": "California is Leading The Way Thanks To Solar Incentives",
        "list_descriptions": "Being one of the sunniest places in the world makes The Golden State ideal for Solar Power. So it comes as no surprise to find the state ranking #1 nationwide in solar capacity. With nearly 4 million homes statewide having gone solar, California is the leader of the pack. But why is this? Well, for one, the generous, year round sunshine. But the state’s solar incentives along with the federal solar tax credit also contribute greatly to the widespread homeowner participation in moving to Solar."
      },
      {
        "list_title": "Your Local Utility Company May Offer Additional Rebates",
        "list_descriptions": "What’s your zip code? Depending on where you live, you could be eligible for additional solar incentive rebates to make your out of pocket cost even lower. The LADWP (Los Angeles Department of Water & Power) as well as SMUD (Sacramento Municipal Utility District) are two examples of California energy companies offering solar rebates based on the estimated potential performance of your home solar panel system. The power company will provide the homeowner with a one time payment for 20 years of production based off of their calculation."
      },
      {
        "list_title": "The Federal Solar Tax Credit",
        "list_descriptions": "The ITC, also known as The Federal Investment Tax Credit, is also available to California homeowners who purchase their solar panel system outright. This credit amounts to 30% of your solar system’s cost after deducting the value of your state rebates. By the end of 2019, however, ITC credits will drop from 30% to 26%. The following year, after 12/31/2020, the tax credits for installations will drop to 22%. This is one of many reasons why it makes sense to go solar now."
      },
      {
        "list_title": "Hassle Free Loans Provide Zero Out Of Pocket Installations",
        "list_descriptions": "Agreements and loan terms can be customized based on your needs, resulting in complete solar panel system installations with zero out of pocket upfront for the homeowner. Our specialists will work with you hand in hand to ensure you take advantage of all the state and federal incentives, credits, and rebates that are available to the California homeowner. We’ll even handle all of the paperwork, streamlining the process for you to get your solar panel system installed hassle free. So just sit back and watch as your energy bill gets crunched in half."
      }
    ]
  },
  {
    "state": "Colorado",
    "short_name": "CO",
    "title": "Colorado Solar Incentives & Rebates",
    "image": "CO.png",
    "list": [
      {
        "list_title": "Colorado Investing Heavily In Solar",
        "list_descriptions": "2015 was a big year for Colorado, with the state investing $305 million in solar projects; and they haven’t slowed down since. A top 10 state in solar energy production, Colorado offers its homeowners some of the most generous tax credits, rebates and incentives in the nation."
      },
      {
        "list_title": "Solar Renewable Energy Credits",
        "list_descriptions": "Among the many ways Colorado homeowners are saving on solar, SRECs, or Solar Renewable Energy Credits, are some of the most generous. However, they’re only available to homeowners who purchase their solar panel system outright, a process that can be overwhelming without a helping hand. But have no fear, Real Solar Quotes is here! With our extensive partnership network, we can hold the SRECs and pass the savings onto the homeowner with the lowest kWh rates out there, allowing you to pay for the power instead of the panels. Basically you reap all the benefits of going solar without the risk and burden of ownership."
      },
      {
        "list_title": "The Federal Solar Tax Credit",
        "list_descriptions": "The ITC, also known as The Federal Investment Tax Credit, is also available to Colorado homeowners who purchase their solar panel system outright. This credit amounts to 30% of your solar system’s cost after deducting the value of your state rebates. But this one isn’t going to be around forever. By the end of 2019 ITC credits will drop from 30% to 26%. The following year, after 12/31/2020, the tax credits for installations will drop to 22%. This is one of many reasons why it makes sense to go solar now."
      },
      {
        "list_title": "Hassle Free Leases & Loans Provide Zero Out Of Pocket Installations",
        "list_descriptions": "Lease agreements and loan terms can be customized based on your needs, resulting in complete solar panel system installations with zero out of pocket upfront for the homeowner. Our specialists will work with you hand in hand to ensure you take advantage of all the state and federal incentives, credits, and rebates that are available to the Colorado homeowner. We’ll even handle all of the paperwork, streamlining the process for you to get your solar panel system installed hassle free. So just sit back and watch as your energy bill gets crunched in half."
      }
    ]
  },
  {
    "state": "Connecticut",
    "short_name": "CT",
    "title": "Connecticut Solar Incentives & Rebates",
    "image": "CT.png",
    "list": [
      {
        "list_title": "Connecticut’s Solar Incentives Are Among The Best & Brightest",
        "list_descriptions": "Connecticut may be a small state, but they’re poised to make a big impact in solar. Thanks to its generous rebate programs and statewide solar panel installation incentives, Connecticut is helping millions of homeowners make the transition to renewable energy."
      },
      {
        "list_title": "Connecticut’s Residential Solar Investment Program",
        "list_descriptions": "CT Green Bank has introduced a truly incredible program called the Homeowner Performance Based Incentive (HOPB) for Connecticut homeowners who choose to go solar. If you install a solar panel system that generates up to 10kW, you can qualify for a rebate of $0.54 per watt. Larger systems that generate more than 10kW qualify for a rebate of $0.40 per watt."
      },
      {
        "list_title": "Property and Sales Tax Exemptions",
        "list_descriptions": "Any homeowner who purchases a solar panel system in the state of Connecticut is exempt from paying sales tax. You’ll also be granted a property tax exemption, making the value added to your home by going solar deductible from the assessed value of your property."
      },
      {
        "list_title": "The Federal Solar Tax Credit",
        "list_descriptions": "The ITC, also known as The Federal Investment Tax Credit, is also available to Connecticut homeowners who purchase their solar panel system outright. This credit amounts to 30% of your solar system’s cost after deducting the value of your state rebates. But this one isn’t going to be around forever. By the end of 2019 ITC credits will drop from 30% to 26%. The following year, after 12/31/2020, the tax credits for installations will drop to 22%. This is one of many reasons why it makes sense to go solar now."
      },
      {
        "list_title": "Hassle Free Leases & Loans Provide Zero Out Of Pocket Installations",
        "list_descriptions": "Lease agreements or loan terms can be customized based on your needs, resulting in complete solar panel system installations with zero out of pocket upfront for the homeowner. Our specialists will work with you hand in hand to ensure you take advantage of all the state and federal incentives, credits, and rebates that are available to Connecticut residents. We’ll even handle all of the paperwork, streamlining the process for you to get your solar panel system installed hassle free. So just sit back and watch as your energy bill gets crunched in half."
      }
    ]
  },
  {
    "state": "Florida",
    "short_name": "FL",
    "title": "Florida Solar Incentives & Rebates",
    "image": "FL.png",
    "list": [
      {
        "list_title": "Florida Beginning To Offer More Solar Incentives",
        "list_descriptions": "The Sunshine State has major solar potential. To date, however, Florida has lagged behind many states when it comes to installed solar capacity. But that may be about to change. With the 3rd best physical and geographic conditions for solar panel systems, Florida is poised to make a serious leap on the renewable energy charts. The state’s solar incentives list is growing, and many Florida homeowners are combining these with the federal solar tax credit to install solar panel systems with as little as zero out of pocket upfront cost."
      },
      {
        "list_title": "Florida Solar & CHP Sales Tax Exemption",
        "list_descriptions": "Homeowners who ditch their conventional energy systems for solar are exempt from paying state sales and use tax. This exemption covers all components utilized in your solar panel system, so it’s not just the panels that are exempt."
      },
      {
        "list_title": "Florida Net Metering",
        "list_descriptions": "Florida homeowners who install solar panel systems are eligible to net meter their systems to get credited for generating more power than they use. What does this mean, exactly? Basically, the utilities company has to credit solar customers for the difference, or net, between your consumption and generation. The excess power generated by your solar panel system is then fed back into the grid. For example, in any given month, your solar system may generate more electricity than you use. In a month where this happens, the utility company will credit you for the excess energy generated at retail rates, and the credits are carried forward for 12 months. If you don’t use these credits within the 12 months, the utility company will pay you for the excess at the avoided cost rate, which is less than retail rates."
      },
      {
        "list_title": "The Federal Solar Tax Credit",
        "list_descriptions": "The ITC, also known as The Federal Investment Tax Credit, is also available to Florida homeowners who purchase their solar panel system outright. This credit amounts to 30% of your solar system’s cost after deducting the value of your state rebates. By the end of 2019, however, ITC credits will drop from 30% to 26%. The following year, after 12/31/2020, the tax credits for installations will drop to 22%. This is one of many reasons why it makes sense to go solar now."
      },
      {
        "list_title": "Hassle Free Loans Provide Zero Out Of Pocket Installations",
        "list_descriptions": "Agreements and loan terms can be customized based on your needs, resulting in complete solar panel system installations with zero out of pocket upfront for the homeowner. Our specialists will work with you hand in hand to ensure you take advantage of all the state and federal incentives, credits, and rebates that are available to the Florida homeowner. We’ll even handle all of the paperwork, streamlining the process for you to get your solar panel system installed hassle free. So just sit back and watch as your energy bill gets crunched in half."
      }
    ]
  },
  {
    "state": "Hawaii",
    "short_name": "HI",
    "title": "Hawaii Solar Incentives & Rebates",
    "image": "HI.png",
    "list": [
      {
        "list_title": "Hawaii’s Solar Incentives Are Shining Bright",
        "list_descriptions": "Being one of the sunniest states in the country makes Hawaii an ideal place for Solar Power. So it comes as no surprise to find the state ranking 3rd overall for solar capacity per capita (watts per person). But why is this? Well, for one, Hawaii offers its residents generous, year round sunshine. But the state’s solar incentives along with the federal solar tax credit also contribute greatly to the widespread homeowner participation in moving to Solar."
      },
      {
        "list_title": "Performance Based Incentives",
        "list_descriptions": "Hawaii’s conventional electricity rates are through the roof - literally the highest in the country. So it makes sense that more and more homeowners are turning to solar. To make up for the loss of net metering, Hawaii has introduced a Performance Based Incentives program, or PBI. If your solar panel system has an output less than or equal to 20kW, you’ll earn $0.22 per kWh for a 20 year term."
      },
      {
        "list_title": "Property Tax Exemption",
        "list_descriptions": "Any homeowner who purchases a solar panel system in the state of Hawaii is eligible for a property tax exemption, making the value added to your home by going solar deductible from the assessed value of your property."
      },
      {
        "list_title": "The Federal Solar Tax Credit",
        "list_descriptions": "The ITC, also known as The Federal Investment Tax Credit, is also available to Hawaii homeowners who purchase their solar panel system outright. This credit amounts to 30% of your solar system’s cost after deducting the value of your state rebates. But this one isn’t going to be around forever. By the end of 2019 ITC credits will drop from 30% to 26%. The following year, after 12/31/2020, the tax credits for installations will drop to 22%. This is one of many reasons why it makes sense to go solar now."
      },
      {
        "list_title": "Hassle Free Loans Provide Zero Out Of Pocket Installations",
        "list_descriptions": "Agreements and loan terms can be customized based on your needs, resulting in complete solar panel system installations with zero out of pocket upfront for the homeowner. Our specialists will work with you hand in hand to ensure you take advantage of all the state and federal incentives, credits, and rebates that are available to the Hawaii homeowner. We’ll even handle all of the paperwork, streamlining the process for you to get your solar panel system installed hassle free. So just sit back and watch as your energy bill gets crunched in half."
      }
    ]
  },
  {
    "state": "Maryland",
    "short_name": "MD",
    "title": "Maryland Solar Incentives & Rebates",
    "image": "MD.png",
    "list": [
      {
        "list_title": "Maryland Offering Solar Tax Incentives and SRECs",
        "list_descriptions": "When it comes to cutting expensive electric bills in half, generous state incentives for switching to solar, and existing statewide capacity for solar, Maryland ranks in the top 5 states nationally. With extremely solar-friendly policies, substantial rebates and Solar Renewable Energy Credits (SRECs), homeowners are guaranteed lower electric bills and a sizeable return on their investment. No wonder more and more Marylanders are moving to Solar."
      },
      {
        "list_title": "Solar Rebate Program",
        "list_descriptions": "Maryland homeowners who switch to solar are eligible for a $1,000 grant upon the installation of their panel system. Real Solar Quotes can help you combine this grant with all of the other credits and incentives into one low monthly payment."
      },
      {
        "list_title": "The Federal Solar Tax Credit",
        "list_descriptions": "The ITC, also known as The Federal Investment Tax Credit, is also available to Maryland homeowners who purchase their solar panel system outright. This credit amounts to 30% of your solar system’s cost after deducting the value of your state rebates. But this one isn’t going to be around forever. By the end of 2019 ITC credits will drop from 30% to 26%. The following year, after 12/31/2020, the tax credits for installations will drop to 22%. This is one of many reasons why it makes sense to go solar now."
      },
      {
        "list_title": "Hassle Free Loans Provide Zero Out Of Pocket Installations",
        "list_descriptions": "Agreements and loan terms can be customized based on your needs, resulting in complete solar panel system installations with zero out of pocket upfront for the homeowner. Our specialists will work with you hand in hand to ensure you take advantage of all the state and federal incentives, credits, and rebates that are available to the Maryland homeowner. We’ll even handle all of the paperwork, streamlining the process for you to get your solar panel system installed hassle free. So just sit back and watch as your energy bill gets crunched in half."
      }
    ]
  },
  {
    "state": "Massachusetts",
    "short_name": "MA",
    "title": "Massachusetts Solar Incentives & Rebates",
    "image": "MA.png",
    "list": [
      {
        "list_title": "Massachusetts Says ‘No’ To Overpaying For Electricity",
        "list_descriptions": "What state has had enough of some of the highest conventional electricity rates in New England? You guessed it: Massachusetts. With environmentally friendly policies and generous statewide solar incentives, The Bay State is becoming a clean energy hub for the whole world to see. When looking at solar capacity and installation metrics, Massachusetts ranks in the top 10 states across the board. With extremely solar-friendly policies, substantial rebates and Solar Renewable Energy Credits (SRECs), homeowners are guaranteed lower electric bills and a sizeable return on their investment. No wonder more and more Massachusetts residents are moving to Solar."
      },
      {
        "list_title": "Massachusetts Offering SRECs",
        "list_descriptions": "Among the many ways Massachusetts homeowners are saving on solar, SRECs, or Solar Renewable Energy Credits, are some of the most generous. However, they’re only available to homeowners who purchase their solar panel system outright, a process that can be overwhelming without a helping hand. But have no fear, Real Solar Quotes is here! With our extensive partnership network, we can hold the SRECs and pass the savings onto the homeowner with the lowest kWh rates out there, paying for the power instead of the panels. Basically you reap all the benefits of going solar without the risk and burden of ownership."
      },
      {
        "list_title": "Residential Renewable Energy Income Credit",
        "list_descriptions": "If you do decide to purchase your home solar panel system outright, you’ll be eligible for an income tax credit that covers 25% of the total cost of your system, capping out at $1,000."
      },
      {
        "list_title": "The Federal Solar Tax Credit",
        "list_descriptions": "The ITC, also known as The Federal Investment Tax Credit, is also available to Massachusetts homeowners who purchase their solar panel system outright. This credit amounts to 30% of your solar system’s cost after deducting the value of your state rebates. But this one isn’t going to be around forever. By the end of 2019 ITC credits will drop from 30% to 26%. The following year, after 12/31/2020, the tax credits for installations will drop to 22%. This is one of many reasons why it makes sense to go solar now."
      },
      {
        "list_title": "Hassle Free Loans Provide Zero Out Of Pocket Installations",
        "list_descriptions": "Agreements and loan terms can be customized based on your needs, resulting in complete solar panel system installations with zero out of pocket upfront for the homeowner. Our specialists will work with you hand in hand to ensure you take advantage of all the state and federal incentives, credits, and rebates that are available to the Massachusetts homeowner. We’ll even handle all of the paperwork, streamlining the process for you to get your solar panel system installed hassle free. So just sit back and watch as your energy bill gets crunched in half."
      }
    ]
  },
  {
    "state": "Nevada",
    "short_name": "NV",
    "title": "Nevada Solar Incentives & Rebates",
    "image": "NV.png",
    "list": [
      {
        "list_title": "Nevada Solar Incentives Are Some of the Largest in The U.S.",
        "list_descriptions": "A top 5 state in solar energy production, Nevada offers its homeowners some of the most generous tax credits, rebates and incentives in the nation.The Renewable Generations Rebate Program is one of them, offering Nevada Energy customers a major opportunity to get paid for their solar panel systems. Homeowners taking advantage of this rebate are getting $1.35 per watt generated, maxing out at $13,500. That’s a lot of green for going green."
      },
      {
        "list_title": "Net Metering",
        "list_descriptions": "Participants in the Renewable Generations Rebate Program must also take part in Nevada Energy’s net metering program, which pays homeowners for the electricity their solar panel systems produce. Basically any excess energy, meaning electricity produced beyond what you’re using each month in your home, is credited to your account, and that credit is carried forward indefinitely. I bet you never thought your energy company would be paying you!"
      },
      {
        "list_title": "Property Tax Abatements",
        "list_descriptions": "Homeowners in Nevada are eligible for a property tax exemption equal to 100% of the value of their solar panel systems. There is no maximum and homeowners can take advantage of the exemption for all fiscal years following the installation of the system."
      },
      {
        "list_title": "The Federal Solar Tax Credit",
        "list_descriptions": "The ITC, also known as The Federal Investment Tax Credit, is also available to Nevada homeowners who purchase their solar panel system outright. This credit amounts to 30% of your solar system’s cost after deducting the value of your state rebates. But this one isn’t going to be around forever. By the end of 2019 ITC credits will drop from 30% to 26%. The following year, after 12/31/2020, the tax credits for installations will drop to 22%. This is one of many reasons why it makes sense to go solar now."
      },
      {
        "list_title": "Hassle Free Leases & Loans Provide Zero Out Of Pocket Installations",
        "list_descriptions": "Lease agreements and loan terms can be customized based on your needs, resulting in complete solar panel system installations with zero out of pocket upfront for the homeowner. Our specialists will work with you hand in hand to ensure you take advantage of all the state and federal incentives, credits, and rebates that are available to the Nevada homeowner. We’ll even handle all of the paperwork, streamlining the process for you to get your solar panel system installed hassle free. So just sit back and watch as your energy bill gets crunched in half."
      }
    ]
  },
  {
    "state": "New Jersey",
    "short_name": "NJ",
    "title": "New Jersey Solar Incentives & Rebates",
    "image": "NJ.png",
    "list": [
      {
        "list_title": "New Jersey Shows Rest of U.S. How Solar Is Done",
        "list_descriptions": "It’s not the sunniest state in the nation but somehow New Jersey ranks in the top 10 in metrics like Cumulative Amount of Solar Electric Capacity Installed (#5), Solar Capacity Per Capita or Watts Per Person (#9), and Number of Solar Jobs (#9). Way to go green Garden State! With extremely solar-friendly policies, substantial rebates and Solar Renewable Energy Credits (SRECs), homeowners are guaranteed lower electric bills and a sizeable return on their investment. No wonder more and more New Jersey residents are moving to Solar."
      },
      {
        "list_title": "New Jersey Offering SRECs",
        "list_descriptions": "Among the many ways New Jersey homeowners are saving on solar, SRECs, or Solar Renewable Energy Credits, are some of the most generous. However, they’re only available to homeowners who purchase their solar panel system outright, a process that can be overwhelming without a helping hand. But have no fear, Real Solar Quotes is here! With our extensive partnership network, we can hold the SRECs and pass the savings onto the homeowner with the lowest kWh rates out there, allowing you to pay for the power instead of the panels. Basically you reap all the benefits of going solar without the risk and burden of ownership."
      },
      {
        "list_title": "The Federal Solar Tax Credit",
        "list_descriptions": "The ITC, also known as The Federal Investment Tax Credit, is also available to New Jersey homeowners who purchase their solar panel system outright. This credit amounts to 30% of your solar system’s cost after deducting the value of your state rebates. But this one isn’t going to be around forever. By the end of 2019 ITC credits will drop from 30% to 26%. The following year, after 12/31/2020, the tax credits for installations will drop to 22%. This is one of many reasons why it makes sense to go solar now."
      },
      {
        "list_title": "Hassle Free Loans Provide Zero Out Of Pocket Installations",
        "list_descriptions": "Agreements and loan terms can be customized based on your needs, resulting in complete solar panel system installations with zero out of pocket upfront for the homeowner. Our specialists will work with you hand in hand to ensure you take advantage of all the state and federal incentives, credits, and rebates that are available to the New Jersey homeowner. We’ll even handle all of the paperwork, streamlining the process for you to get your solar panel system installed hassle free. So just sit back and watch as your energy bill gets crunched in half."
      }
    ]
  },
  {
    "state": "New York",
    "short_name": "NY",
    "title": "New York Solar Incentives & Rebates",
    "image": "NY.png",
    "list": [
      {
        "list_title": "New York Shows Rest of U.S. How Solar Is Done",
        "list_descriptions": "It’s not the sunniest state in the nation but somehow New York ranks in the top 10 in metrics like Cumulative Amount of Solar Electric Capacity Installed (#10) and Number of Solar Jobs (#6). Way to go green New York! With extremely solar-friendly policies and substantial rebates, homeowners are guaranteed lower electric bills and a sizeable return on their investment. Considering New Yorkers pay some of the highest conventional electricity rates in the country, transitioning to sustainable solar makes a whole lot of sense."
      },
      {
        "list_title": "New York’s Solar Energy System Equipment Credit",
        "list_descriptions": "Homeowners who purchase their solar panel system outright are eligible for a generous state tax credit known as the Solar Energy System Equipment Credit. This covers 25% of your total system cost, or $5,000, whichever is less. For taxpayers who may not meet the minimum threshold to claim the credit at once, the excess can be carried over to the following fiscal year."
      },
      {
        "list_title": "The Federal Solar Tax Credit",
        "list_descriptions": "The ITC, also known as The Federal Investment Tax Credit, is also available to New York homeowners who purchase their solar panel system outright. This credit amounts to 30% of your solar system’s cost after deducting the value of your state rebates. But this one isn’t going to be around forever. By the end of 2019 ITC credits will drop from 30% to 26%. The following year, after 12/31/2020, the tax credits for installations will drop to 22%. This is one of many reasons why it makes sense to go solar now."
      },
      {
        "list_title": "Hassle Free Loans Provide Zero Out Of Pocket Installations",
        "list_descriptions": "Agreements and loan terms can be customized based on your needs, resulting in complete solar panel system installations with zero out of pocket upfront for the homeowner. Our specialists will work with you hand in hand to ensure you take advantage of all the state and federal incentives, credits, and rebates that are available to the New York homeowner. We’ll even handle all of the paperwork, streamlining the process for you to get your solar panel system installed hassle free. So just sit back and watch as your energy bill gets crunched in half."
      }
    ]
  },
  {
    "state": "South Carolina",
    "short_name": "SC",
    "title": "South Carolina Solar Incentives & Rebates",
    "image": "SC.png",
    "list": [
      {
        "list_title": "South Carolina Homeowners Get The Most Solar Incentives in the Southeast",
        "list_descriptions": "With extremely forward thinking, solar-friendly policies and substantial tax credits and rebates, South Carolina homeowners are slashing their electric bills in half while seeing a sizeable return on their solar panel system investment. But how can you take advantage of the state’s multitude of incentives, rebates, and credits from day 1? The answer is Real Solar Quotes."
      },
      {
        "list_title": "Solar Panel Tax Credits",
        "list_descriptions": "Homeowners who purchase their solar panel system outright are eligible for a generous state tax credit that covers 25% of your total system cost. For taxpayers who may not meet the minimum threshold to claim the credit, it can be carried over to the following fiscal year."
      },
      {
        "list_title": "The Federal Solar Tax Credit",
        "list_descriptions": "The ITC, also known as The Federal Investment Tax Credit, is also available to South Carolina homeowners who purchase their solar panel system outright. This credit amounts to 30% of your solar system’s cost after deducting the value of your state rebates. But this one isn’t going to be around forever. By the end of 2019 ITC credits will drop from 30% to 26%. The following year, after 12/31/2020, the tax credits for installations will drop to 22%. This is one of many reasons why it makes sense to go solar now."
      },
      {
        "list_title": "Hassle Free Loans Provide Zero Out Of Pocket Installations",
        "list_descriptions": "Agreements and loan terms can be customized based on your needs, resulting in complete solar panel system installations with zero out of pocket upfront for the homeowner. Our specialists will work with you hand in hand to ensure you take advantage of all the state and federal incentives, credits, and rebates that are available to the South Carolina homeowner. We’ll even handle all of the paperwork, streamlining the process for you to get your solar panel system installed hassle free. So just sit back and watch as your energy bill gets crunched in half."
      }
    ]
  },
  {
    "state": "Texas",
    "short_name": "TX",
    "title": "Texas Solar Incentives & Rebates",
    "image": "TX.png",
    "list": [
      {
        "list_title": "Texas Homeowners Are Cashing In On Solar Incentives",
        "list_descriptions": "Texas has abundant solar resources and homeowners are taking advantage of it. The state is quickly climbing the charts when it comes to the cumulative amount of solar electric capacity installed, meaning Texas is a leader in renewable energy deployment. One reason is the state’s solar incentives, which are often paired with the federal solar tax credit to give Texas homeowners the opportunity to go solar with zero out of pocket upfront cost."
      },
      {
        "list_title": "Property Assessed Clean Energy Financing",
        "list_descriptions": "Property Assessed Clean Energy Financing, or PACE, offers Texas homeowners the option to finance solar panel system installation by placing an assessment on the land. The amount financed can be paid via property taxes on a yearly basis until the solar panel system is paid off. However, not all local governments offer PACE financing, although many do."
      },
      {
        "list_title": "The Federal Solar Tax Credit",
        "list_descriptions": "The ITC, also known as The Federal Investment Tax Credit, is available to Texas homeowners who purchase their solar panel system outright. This credit amounts to 30% of your solar system’s cost after deducting the value of your state rebates. By the end of 2019, however, ITC credits will drop from 30% to 26%. The following year, after 12/31/2020, the tax credits for installations will drop to 22%. This is one of many reasons why it makes sense to go solar now."
      },
      {
        "list_title": "Hassle Free Loans Provide Zero Out Of Pocket Installations",
        "list_descriptions": "Agreements and loan terms can be customized based on your needs, resulting in complete solar panel system installations with zero out of pocket upfront for the homeowner. Our specialists will work with you hand in hand to ensure you take advantage of all the state and federal incentives, credits, and rebates that are available to the South Carolina homeowner. We’ll even handle all of the paperwork, streamlining the process for you to get your solar panel system installed hassle free. So just sit back and watch as your energy bill gets crunched in half."
      }
    ]
  }
]
